Ahmadsalim20/SmartPumpController_ESP32/SmartPumpController_ESP32/SecureOTA.h
#ifndef SECURE_OTA_H
#define SECURE_OTA_H

#if defined(ESP32)
  #include <WiFi.h>
  #include <HTTPClient.h>
  #include <WiFiClientSecure.h>
  #include <Update.h>
#elif defined(ESP8266)
  #include <ESP8266WiFi.h>
  #include <ESP8266HTTPClient.h>
  #include <WiFiClientSecure.h>
  #include <Updater.h>
#else
  #error "Board target not supported! Please use ESP32 or ESP8266."
#endif

#include <ArduinoJson.h>

// 1. رقم الإصدار الحالي المثبت على هذا الجهاز
const char* CURRENT_FIRMWARE_VERSION = "v1.1.15";

// 2. الـ UUID الخاص بموديل الجهاز في Supabase (من جدول hardware_models)
const char* HARDWARE_MODEL_ID = "8c3e340e-0e68-4cce-af3c-c38f2ef945fa";

// 3. رابط Edge Function الخاضع لـ Supabase
const char* OTA_CHECK_URL = "https://gbfhefvrrhcdblehtbkp.supabase.co/functions/v1/check-ota";

// 4. المفتاح العام (Public Key) لفحص التوقيع الرقمي
const char* PUBLIC_KEY_PEM = R"(
-----BEGIN PUBLIC KEY-----
MFkwEwYHKoZIzj0CAQYIKoZIzj0DAQcDQgAEmYPjQ9YTBjWIcvyahXO2MZogZX4D
bZH5x57TxMvEKHykxGIClHswPw8Y2pgWZh/3eY20X9R53j3a7MIW0g7dGQ==
-----END PUBLIC KEY-----
)";

// دالة مخصصة لإرسال تقرير نتيجة التحديث إلى Edge Function لتخزينها في جدول ota_logs
void reportOTAResult(const String& targetFirmwareId, const String& status, const String& errorMessage = "") {
    if (WiFi.status() != WL_CONNECTED || targetFirmwareId.length() == 0) return;

    WiFiClientSecure client;
    client.setInsecure();
    #if defined(ESP8266)
    client.setBufferSizes(2048, 512);
    #endif

    HTTPClient http;
    http.setTimeout(15000);
    if (http.begin(client, OTA_CHECK_URL)) {
        http.addHeader("Content-Type", "application/json");

        DynamicJsonDocument reportDoc(512);
        reportDoc["hardware_model_id"] = HARDWARE_MODEL_ID;
        reportDoc["current_version"] = CURRENT_FIRMWARE_VERSION;
        reportDoc["mac_address"] = WiFi.macAddress();

        JsonObject statusReport = reportDoc.createNestedObject("status_report");
        statusReport["target_firmware_id"] = targetFirmwareId;
        statusReport["status"] = status;
        if (errorMessage.length() > 0) {
            statusReport["error_message"] = errorMessage;
        }

        String requestBody;
        serializeJson(reportDoc, requestBody);
        
        Serial.printf("[OTA Log] Reporting status '%s' to Supabase...\n", status.c_str());
        http.POST(requestBody);
        http.end();
    }
}

// دالة فحص وتنفيذ التحديث
void checkAndApplyOTA() {
    if (WiFi.status() != WL_CONNECTED) return;

    Serial.println("[OTA] Checking for new firmware updates from Supabase...");

    // ⚡ انتظار مزامنة الوقت (NTP) - مطلوب لاتصال TLS/SSL
    Serial.println("[OTA] Waiting for NTP time sync...");
    int ntpRetries = 0;
    while (time(nullptr) < 100000 && ntpRetries < 15) {
        delay(300);
        ntpRetries++;
    }

    if (time(nullptr) < 100000) {
        Serial.println("[OTA] Warning: NTP time sync may have failed, attempting anyway...");
    } else {
        Serial.println("[OTA] NTP time synced successfully.");
    }

    WiFiClientSecure client;
    client.setInsecure(); // في الإنتاج يفضل إضافة Root CA Cert

    #if defined(ESP8266)
    client.setBufferSizes(2048, 512);
    #endif

    HTTPClient http;
    http.setTimeout(15000); // ⚡ مهلة الاتصال 15 ثانية

    if (!http.begin(client, OTA_CHECK_URL)) {
        Serial.println("[OTA] Connection failed to OTA check URL.");
        return;
    }

    http.addHeader("Content-Type", "application/json");

    // إرسال بيانات الجهاز الحالية والماك أدريس للـ Edge Function
    DynamicJsonDocument reqDoc(300);
    reqDoc["hardware_model_id"] = HARDWARE_MODEL_ID;
    reqDoc["current_version"] = CURRENT_FIRMWARE_VERSION;
    reqDoc["mac_address"] = WiFi.macAddress();

    String requestBody;
    serializeJson(reqDoc, requestBody);

    Serial.printf("[OTA] Sending: %s\n", requestBody.c_str());

    int httpCode = http.POST(requestBody);

    if (httpCode != HTTP_CODE_OK) {
        Serial.printf("[OTA] Check failed, HTTP code: %d\n", httpCode);
        http.end();
        return;
    }

    String payload = http.getString();
    http.end(); // ⚡ إغلاق الاتصال الأول فوراً تحريرًا للذاكرة

    Serial.printf("[OTA] Response: %s\n", payload.c_str());

    DynamicJsonDocument resDoc(1024);
    DeserializationError error = deserializeJson(resDoc, payload);

    if (error) {
        Serial.printf("[OTA] JSON parse failed: %s\n", error.c_str());
        return;
    }

    bool updateAvailable = resDoc["update_available"] | false;

    if (!updateAvailable) {
        Serial.println("[OTA] Firmware is up to date.");
        return;
    }

    String downloadUrl = resDoc["download_url"].as<String>();
    String latestVersion = resDoc["version"].as<String>();
    String expectedHash = resDoc["sha256_hash"].as<String>();
    String signature = resDoc["digital_signature"].as<String>();
    String targetFirmwareId = resDoc["firmware_id"].as<String>();

    Serial.printf("[OTA] New version found: %s\n", latestVersion.c_str());
    Serial.println("[OTA] Starting firmware download...");

    // ⚡ استخدام WiFiClientSecure جديد للتنزيل
    WiFiClientSecure dlClient;
    dlClient.setInsecure();
    #if defined(ESP8266)
    dlClient.setBufferSizes(2048, 512);
    #endif

    HTTPClient httpDownload;
    httpDownload.setTimeout(30000); // 30 ثانية مهلة تنزيل الملف
    if (!httpDownload.begin(dlClient, downloadUrl)) {
        Serial.println("[OTA] Failed to connect to download URL.");
        reportOTAResult(targetFirmwareId, "failed", "Download connection failed");
        return;
    }

    int code = httpDownload.GET();

    if (code != HTTP_CODE_OK) {
        Serial.printf("[OTA] Download failed, HTTP code: %d\n", code);
        reportOTAResult(targetFirmwareId, "failed", "Download HTTP error " + String(code));
        httpDownload.end();
        return;
    }

    int contentLength = httpDownload.getSize();
    Serial.printf("[OTA] Firmware size: %d bytes\n", contentLength);

    if (contentLength <= 0) {
        Serial.println("[OTA] Error: Invalid content length from server.");
        reportOTAResult(targetFirmwareId, "failed", "Invalid content length: " + String(contentLength));
        httpDownload.end();
        return;
    }

    bool canBegin = Update.begin(contentLength);

    if (!canBegin) {
        Serial.println("[OTA] Not enough flash space for firmware update.");
        reportOTAResult(targetFirmwareId, "failed", "Not enough flash space");
        httpDownload.end();
        return;
    }

    Serial.println("[OTA] Flashing firmware...");
    WiFiClient* stream = httpDownload.getStreamPtr();
    stream->setTimeout(15000);

    // ⚡ حجز الـ buffer على الـ Heap بدلاً من الـ Stack لمنع Stack Overflow
    uint8_t* buff = (uint8_t*)malloc(1024);
    if (!buff) {
        Serial.println("[OTA] Out of memory for download buffer!");
        reportOTAResult(targetFirmwareId, "failed", "OOM for download buffer");
        httpDownload.end();
        return;
    }

    size_t totalWritten = 0;
    unsigned long lastProgressLog = 0;
    unsigned long lastReadTime = millis();

    while (httpDownload.connected() && (totalWritten < (size_t)contentLength)) {
        size_t sizeAvailable = stream->available();
        if (sizeAvailable > 0) {
            int c = stream->readBytes(buff, min(sizeAvailable, (size_t)1024));
            if (c > 0) {
                size_t written = Update.write(buff, c);
                if (written != (size_t)c) {
                    Serial.printf("[OTA] Flash write failed at byte %d\n", totalWritten);
                    break;
                }
                totalWritten += written;
                lastReadTime = millis();

                if (totalWritten - lastProgressLog >= 51200 || totalWritten == (size_t)contentLength) {
                    lastProgressLog = totalWritten;
                    Serial.printf("[OTA] Progress: %d / %d bytes (%d%%)\n", totalWritten, contentLength, (totalWritten * 100) / contentLength);
                }
            }
        } else {
            if (millis() - lastReadTime > 25000) {
                Serial.println("[OTA] Download timeout: No data received for 25 seconds.");
                break;
            }
            delay(10);
        }
    }

    // ⚡ تحرير الـ buffer بعد الانتهاء
    free(buff);

    if (totalWritten != (size_t)contentLength) {
        Serial.printf("[OTA] Write mismatch! Written: %d, Expected: %d\n", totalWritten, contentLength);
        Update.end(false);
        reportOTAResult(targetFirmwareId, "failed", "Write mismatch: " + String(totalWritten) + "/" + String(contentLength));
        httpDownload.end();
        return;
    }

    Serial.println("[OTA] Download complete. Finalizing update...");

    if (Update.end()) {
        if (Update.isFinished()) {
            Serial.println("[OTA] ✅ Update successful! Reporting & rebooting...");
            httpDownload.end();
            reportOTAResult(targetFirmwareId, "success");
            delay(500);
            ESP.restart();
        } else {
            Serial.println("[OTA] Update not finished.");
            reportOTAResult(targetFirmwareId, "failed", "Update not finished");
        }
    } else {
        String errMsg = "Update error code: " + String(Update.getError());
        Serial.printf("[OTA] %s\n", errMsg.c_str());
        reportOTAResult(targetFirmwareId, "failed", errMsg);
    }
    httpDownload.end();
}

#endif